pebble-dev/pebble-firmware/src/bluetooth-fw/nrf52/init.c
#include "nrf_sdh.h"
#include "nrf_sdh_ble.h"
#include "ble_dis.h"
#include "ble_advdata.h"

#include "comm/bt_lock.h"
#include "drivers/qemu/qemu_serial.h"
#include "drivers/qemu/qemu_settings.h"
#include "kernel/event_loop.h"
#include "pebble_errors.h"
#include "system/logging.h"
#include "system/passert.h"
#include "board/board.h"

#include <bluetooth/init.h>
#include <bluetooth/dis.h>
#include <bluetooth/id.h>
#include <bluetooth/qemu_transport.h>
#include <bluetooth/bt_driver_advert.h>

#include <stdlib.h>

#define CONN_TAG 1

static bool s_callback_pending = false;
static void prv_sdh_evts_poll_cb(void *ctx) {
  s_callback_pending = false;
  nrf_sdh_evts_poll();
}

void SD_EVT_IRQHandler(void)
{
  BaseType_t yield_req = false;

  if (!s_callback_pending) {
    PebbleEvent e = {
      .type = PEBBLE_CALLBACK_EVENT,
      .callback = {
        .callback = prv_sdh_evts_poll_cb,
        .data = NULL
      }
    };
    yield_req |= event_put_isr(&e);
    s_callback_pending = true;
  }

  portEND_SWITCHING_ISR(yield_req);
}
IRQ_MAP_NRFX(SWI2_EGU2, SD_EVT_IRQHandler);

// ----------------------------------------------------------------------------------------
void bt_driver_init(void) {
  ret_code_t rv;

  bt_lock_init();

  /* the softdevice was enabled by early init so the LFCLK / RTC will work */
  PBL_LOG(LOG_LEVEL_INFO, "nRF52: enabling BLE");

  uint32_t ram_start = 0;
  extern uint8_t __KERNEL_RAM_start__;
  uint32_t pebbleos_ram_start = (uint32_t) &__KERNEL_RAM_start__;

  rv = nrf_sdh_ble_default_cfg_set(CONN_TAG, &ram_start);
  PBL_ASSERTN(rv == NRF_SUCCESS);
  PBL_ASSERTN(ram_start <= pebbleos_ram_start);

  rv = nrf_sdh_ble_enable(&pebbleos_ram_start);
  PBL_ASSERTN(rv == NRF_SUCCESS);
  PBL_LOG(LOG_LEVEL_INFO, "nRF52: BLE stack enabled");
}

static BTDeviceAddress s_identity_address; /* initialized at bt_driver_start time */
void bt_driver_id_copy_local_identity_address(BTDeviceAddress *addr_out) {
  *addr_out = s_identity_address;
}

static DisInfo s_dis_info;

bool bt_driver_start(BTDriverConfig *config) {
  PBL_LOG(LOG_LEVEL_INFO, "nRF52: BLE driver start");

  ret_code_t rv;

  /* XXX: config->root_keys: sd_ble_gap_device_identities_set -- https://docs.nordicsemi.com/bundle/s140_v7.2.0_api/page/group_b_l_e_g_a_p_f_u_n_c_t_i_o_n_s.html#ga16fa7a0ac608c4955a2e4feea7a10784 */

  /* BLE device information service */
  s_dis_info = config->dis_info;
  static ble_dis_init_t dis_init = {
    .dis_char_rd_sec = SEC_OPEN /* XXX: or SEC_JUST_WORKS? */,
    .model_num_str = { .length = sizeof(s_dis_info.model_number), .p_str = (uint8_t *) &s_dis_info.model_number },
    .manufact_name_str = { .length = sizeof(s_dis_info.manufacturer), .p_str = (uint8_t *) &s_dis_info.manufacturer },
    .serial_num_str = { .length = sizeof(s_dis_info.serial_number), .p_str = (uint8_t *) &s_dis_info.serial_number },
    .fw_rev_str = { .length = sizeof(s_dis_info.fw_revision), .p_str = (uint8_t *) &s_dis_info.fw_revision },
    .sw_rev_str = { .length = sizeof(s_dis_info.sw_revision), .p_str = (uint8_t *) &s_dis_info.sw_revision },
  };
  rv = ble_dis_init(&dis_init);
  PBL_ASSERTN(rv == NRF_SUCCESS);

  /* config->identity_addr is an OUTPUT from here, but TI does not set it. 
   * all the same, we will do it here.  we grab the identity_addr on boot,
   * so it is unaffected by later calls to bt_driver_set_local_address */
  ble_gap_addr_t addr;
  sd_ble_gap_addr_get(&addr);
  memcpy(&s_identity_address, addr.addr, 6);

  bt_driver_id_copy_local_identity_address(&config->identity_addr);

  /* config->is_hrm_supported_and_enabled */

  PBL_ASSERTN(!config->is_hrm_supported_and_enabled);
  static uint8_t _name_buf[24] = "Asterix softdevice";
  
  ble_gap_conn_sec_mode_t sec_mode;
  BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);
  sd_ble_gap_device_name_set(&sec_mode, _name_buf, strlen((char *)_name_buf));
  
  sd_ble_gap_appearance_set(BLE_APPEARANCE_GENERIC_WATCH);
  
  prv_sdh_evts_poll_cb(NULL);
  
  return true;
}

void bt_driver_stop(void) {
  /* XXX: all to do here is shut down advertising, and sd_ble_gap_disconnect
   * if we are connected; this will shut down the radio entirely (and there
   * is no other way to reset the softdevice through airplane mode or any
   * such, if it wedges you're on your own and it's time to boot) */
  bt_driver_advert_advertising_disable();
}

void bt_driver_power_down_controller_on_boot(void) {
  // nRF BLE boots up powered off (it's internal), so nothign to do here
}
